#include <iostream>
#include <vector>
std::vector<int> primeFactorize(int n)
{
    std::vector<int> result;
    for(int i=2;i<n;i++) // i փոփոխականը,2-ից սկսած,ձգտելու  է մինչև n-ի արժեքը և՝  ցիկլի նեսում գտնվող  գործողությունները կատարելուց հետո ամեն անգամ 1-ով մեծացնելով իր արժէքը։
    {
        while(n%i==0)  // քանի դեռ n-ը առանց մնացորդ բաժանվում է i-ին, ամեն անգամ push է անում մեր վեկտորի վերջին տարրը՝ ընդունելով  i-ի արժեքը, և n-ը բաժանվում է i-ի վրա։Այդ գործողությունները տեղի են ունենալու,մինչև n-ը չբաժանվի i-ի վրա՝ արդեն մնացորդով։Դրանից հետո i-ին գումարվելու է 1 և այդպես շարունակ՝մինչև չհավասարվի n-ի արժեքին։
        {
            result.push_back(i);
            n/=i;
        }
    }
    return result;
}